MinSteve/hal_nxp/s32k/s32k-sdk/devices/S32K144W/S32K144W.svd
        <register>
          <name>TCD0_DADDR</name>
          <description>TCD Destination Address</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DADDR</name>
              <description>Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_DOFF</name>
          <description>TCD Signed Destination Address Offset</description>
          <addressOffset>0x1014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DOFF</name>
              <description>Destination Address Signed Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_CITER_ELINKNO</name>
          <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
          <alternateGroup>CITER</alternateGroup>
          <addressOffset>0x1016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CITER</name>
              <description>Current Major Iteration Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enable channel-to-channel linking on minor-loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELINK_0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELINK_1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_CITER_ELINKYES</name>
          <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
          <alternateGroup>CITER</alternateGroup>
          <addressOffset>0x1016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CITER</name>
              <description>Current Major Iteration Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKCH</name>
              <description>Minor Loop Link Channel Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enable channel-to-channel linking on minor-loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELINK_0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELINK_1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_DLASTSGA</name>
          <description>TCD Last Destination Address Adjustment/Scatter Gather Address</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DLASTSGA</name>
              <description>DLASTSGA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_CSR</name>
          <description>TCD Control and Status</description>
          <addressOffset>0x101C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Channel Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_0</name>
                  <description>The channel is not explicitly started.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_1</name>
                  <description>The channel is explicitly started via a software initiated service request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMAJOR</name>
              <description>Enable an interrupt when major iteration count completes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTMAJOR_0</name>
                  <description>The end-of-major loop interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTMAJOR_1</name>
                  <description>The end-of-major loop interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTHALF</name>
              <description>Enable an interrupt when major counter is half complete.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTHALF_0</name>
                  <description>The half-point interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTHALF_1</name>
                  <description>The half-point interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DREQ</name>
              <description>Disable Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DREQ_0</name>
                  <description>The channel's ERQ bit is not affected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DREQ_1</name>
                  <description>The channel's ERQ bit is cleared when the major loop is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESG</name>
              <description>Enable Scatter/Gather Processing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESG_0</name>
                  <description>The current channel's TCD is normal format.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESG_1</name>
                  <description>The current channel's TCD specifies a scatter gather format. The DLASTSGA field provides a memory pointer to the next TCD to be loaded into this channel after the major loop completes its execution.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJORELINK</name>
              <description>Enable channel-to-channel linking on major loop complete</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAJORELINK_0</name>
                  <description>The channel-to-channel linking is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAJORELINK_1</name>
                  <description>The channel-to-channel linking is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>Channel Active</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Channel Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAJORLINKCH</name>
              <description>Major Loop Link Channel Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BWC</name>
              <description>Bandwidth Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BWC_0</name>
                  <description>No eDMA engine stalls.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWC_2</name>
                  <description>eDMA engine stalls for 4 cycles after each R/W.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BWC_3</name>
                  <description>eDMA engine stalls for 8 cycles after each R/W.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_BITER_ELINKNO</name>
          <description>TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
          <alternateGroup>BITER</alternateGroup>
          <addressOffset>0x101E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BITER</name>
              <description>Starting Major Iteration Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enables channel-to-channel linking on minor loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELINK_0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELINK_1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD0_BITER_ELINKYES</name>
          <description>TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
          <alternateGroup>BITER</alternateGroup>
          <addressOffset>0x101E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BITER</name>
              <description>Starting major iteration count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINKCH</name>
              <description>Link Channel Number</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELINK</name>
              <description>Enables channel-to-channel linking on minor loop complete</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELINK_0</name>
                  <description>The channel-to-channel linking is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELINK_1</name>
                  <description>The channel-to-channel linking is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD1_SADDR</name>
          <description>TCD Source Address</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCD1_SOFF</name>
          <description>TCD Signed Source Address Offset</description>
          <addressOffset>0x1024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SOFF</name>
              <description>Source address signed offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
